[
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion",
    "slug": "open-protocol-discussion",
    "title": "Open Protocol Discussion",
    "startDate": "2020-06-04",
    "startTime": "18:00 UTC",
    "location": "ONLINE",
    "speakers": "Nicolas Barry, David Mazières, Jed McCaleb, Jonathan Jove, Leigh McCulloch, Orbit Lens, Eric Saunders, Tomer Weller, Tom Quisel, and Justin Rice",
    "description": "Join us for the first-ever broadcast of the Open Protocol Discussion, a bi-weekly meeting in which we plan for changes to upcoming versions of the Stellar Protocol.",
    "topics": "Join us for the first-ever broadcast of the Open Protocol Discussion, a bi-weekly meeting in which we plan for changes to upcoming versions of the Stellar Protocol. In this week's meeting, we'll focus on Core Advancement Proposals slated for Protocol 14 and cover a few administrative tasks related to the current rollout of Protocol 13.\nIt's a technical discussion, so if you plan on watching, we advise reading through the following CAPs and issues for context:\n- CAP-33: New Sponsored Reserves\n- CAP-23: Two-part Payments\n- Issue 622: Request to change close time application\n- Issue 624: Update CAP process\nThose are in our public Github repo, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by contributing to those issues and CAPs. If you're interested in keeping on top of protocol changes, you can also join the Stellar developers google group:\nhttps://groups.google.com/forum/#!forum/stellar-dev"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-2",
    "slug": "open-protocol-discussion-2",
    "title": "Open Protocol Discussion",
    "startDate": "2020-07-09",
    "startTime": "18:00 UTC",
    "location": "ONLINE",
    "speakers": "Nicolas Barry, David Mazières, Jed McCaleb, Jonathan Jove, Leigh McCulloch, Orbit Lens, Eric Saunders, Tomer Weller, Tom Quisel, and Justin Rice",
    "description": "Join us for the second broadcast of the Open Protocol Discussion, a bi-weekly meeting in which we discuss and plan for changes to upcoming versions of the Stellar Protocol. ",
    "topics": "Join us for the second broadcast of the Open Protocol Discussion, a bi-weekly meeting in which we discuss and plan for changes to upcoming versions of the Stellar Protocol.\nThis week, we'll talk about progress preparing for Protocol 14 and go over a few final issues with the big Protocol 14 CAPs.\nIt's a technical discussion, so if you plan on watching, we advise reading through the following CAPs and discussions in advance:\n- CAP-23: Two-part Payments\n- CAP-23 Discussion\n- CAP-33: New Sponsored Reserves\n- CAP-33 Discussion\n- Issue 622: Request to change close time application\nThose CAPs are in our public Github repo, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by contributing there, or by joining the relevant threads linked to above. If you're generally interested in keeping on top of protocol changes, make sure to join the Stellar developers google group:\nhttps://groups.google.com/forum/#!forum/stellar-dev\n‍"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-1-28-2021",
    "slug": "open-protocol-discussion-1-28-2021",
    "title": "Open Protocol Discussion (1/28/21)",
    "startDate": "2021-01-28",
    "startTime": "19:00 UTC",
    "location": "",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Dan Doney, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol, and this week, we'll once again focus on a Core Advancement Proposal that would provide an issuer the means to claw back an asset in order to support regulatory requirements. ",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol, and this week, we'll once again focus on a Core Advancement Proposal that would provide an issuer the means to claw back an asset in order to support regulatory requirements.\nTo be clear: this proposal would add a new kind of asset flag to the protocol, and new operations to make use of it. It would have no effect on existing assets, and would be transparent to any potential holders of a claw-backable asset.\nIt's a technical discussion, so if you plan on watching, we advise reading through the following CAPs and discussion threads for context:\n- CAP-35: Asset Clawback\n- CAP-35 discussion thread\nThose CAPs are in a public Github repo, and the discussion threads are on a public mailing list, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation. If you're interested in keeping on top of protocol changes, you can also join the Stellar Developers Google group.\n‍"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-3-11-21",
    "slug": "open-protocol-discussion-3-11-21",
    "title": "Open Protocol Discussion (3/11/21)",
    "startDate": "2021-03-11",
    "startTime": "19:00 UTC",
    "location": "",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol.",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol.\nThis week, we will be focusing on proposed changes to CAP-21, which generalizes the timeBounds field in transactions to support other conditions, including conditions that relax sequence number checking and provide relative time locks. The goal of the proposed revisions is to create relative time locks for payment channels, and in general to expand the capabilities of preconditions on transactions.\nIt's a technical discussion, so if you want to follow along, we suggest reading both the proposal itself and the recent discussion about the proposed changes. If you're interested in keeping on top of protocol changes, you can also join the Stellar Developers Google group."
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-4-22-21",
    "slug": "open-protocol-discussion-4-22-21",
    "title": "Open Protocol Discussion (4/22/21)",
    "startDate": "2021-04-22",
    "startTime": "18:00 UTC",
    "location": "",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol.",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion on April 22nd at 2:00 PM ET! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol.\nThis week, we will start to delve into two CAP drafts, both of which aim to add automated-market-making capabilities to Stellar Core. AMMs are a big topic, and the goal today is simply to raise key questions about the proposals so that the debate and discussion can continue on the open-participation Stellar Developers Google Group. This is a technical meeting, so if you are interested in following along, we encourage you to read through both proposals and the relevant discussions to get your bearings:\nCAP-37\n- Proposal\n- Discussion\nCAP-38\n- Proposal\n- Discussion\nIf you have thoughts about AMMs and would like to participate in the discussion, join the Stellar Developers Google Group!"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-6-17-21",
    "slug": "open-protocol-discussion-6-17-21",
    "title": "Open Protocol Discussion (6/17/21)",
    "startDate": "2021-06-17",
    "startTime": "18:00 UTC",
    "location": "",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion on June 17th at 2:00 PM ET! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol.",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion on June 17th at 2:00 PM ET! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol.\nThis week, we will be going over two recent Core Advancement Proposals — CAP-37 and CAP-38 — that have the same objective: to add automated market makers to the Stellar Protocol in order to improve overall liquidity on the network. This is a technical discussion, so if you are interested in following along, we suggest reading both proposals and the mailing list discussions about them in advance.\n\nCAP-37\n- Proposal\n- Discussion\nCAP-38\n- Proposal\n- Discussion\n‍\nIf you have thoughts about AMMs and would like to participate in the discussion, join the Stellar Developers Google Group!"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-7-29-21",
    "slug": "open-protocol-discussion-7-29-21",
    "title": "Open Protocol Discussion (7/29/21)",
    "startDate": "2021-07-29",
    "startTime": "18:00 UTC",
    "location": "",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion on July 29th at 2:00 PM ET as we discuss and plan for changes to upcoming versions of the Stellar Protocol.",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion on July 29th at 2:00 PM ET! In this meeting, we will discuss two Core Advancement Proposals (CAPs) that lay the groundwork for building payment channels on Stellar: CAP-21, which would generalize transaction preconditions, and CAP-40, which would allow participants in a payment channel to safely exchange signatures for a set of up to three transactions in a single-step.\nThis is a technical discussion, so if you are interested in following along, you may want to prepare by reading the proposals themselves, along with the Stellar Developers Group discussion about them:\nCAP-21\n- Proposal\n- Discussion\nCAP-40\n- Proposal\n- Discussion\nIf you would like to participate in future discussions about protocol changes, join the Stellar Developers Google Group!\n‍"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-9-9-21",
    "slug": "open-protocol-discussion-9-9-21",
    "title": "Open Protocol Discussion (9/9/21)",
    "startDate": "2021-09-09",
    "startTime": "18:00 UTC",
    "location": "",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion on September 9th at 2:00 PM ET! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol.",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion on September 9th at 2:00 PM ET! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. Today, we'll once again be talking about CAP-21, which suggests a change to the Stellar Protocol that would lay the foundation for building payment channels on Stellar.\n‍\nIf you would like to participate in the discussion, join the Stellar Developers Google Group!"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-10-14-21",
    "slug": "open-protocol-discussion-10-14-21",
    "title": "Open Protocol Discussion (10/14/21)",
    "startDate": "2021-10-14",
    "startTime": "18:00 UTC",
    "location": "Virtual",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion on October 14 at 2:00 PM ET! ",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion on October 14 at 2:00 PM ET! In these bi-weekly meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. This week, we will be reviewing the final changes to CAP-38: Automated Market Makers in advance of the November Protocol 18 Upgrade vote. If you are interested in following along, we suggest reading through the CAP in advance.\nIf you would like to participate in the discussion, join the Stellar Developers Google Group!"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-2-3-2022",
    "slug": "open-protocol-discussion-2-3-2022",
    "title": "Open Protocol Discussion (2/3/2022)",
    "startDate": "2022-02-03",
    "startTime": "19:00 UTC",
    "location": "Virtual",
    "speakers": "David Mazières, Eric Saunders, Karen Chang, Leigh McCulloch, Nicolas Barry, Jed McCaleb, Jonathan Jove, Orbit Lens, Siddharth Suresh, Tomer Weller and Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol, and this week, we'll focus on a Core Advancement Proposal that would allow grouping of transactions in order to facilitate the implementation of per-group policies, such as order-book-aware surge pricing. It's a technical discussion, so if you plan on watching, we advise reading through the CAP and the relevant discussion thread for context: CAP-42: Multi-part Transaction Sets\nMailing list discussion thread CAPs are in a public Github repo, and the discussion threads are on a public mailing list, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation. If you're interested in keeping on top of protocol changes, you can also join the Stellar developers google group: https://groups.google.com/forum/#!forum/stellar-dev ",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol, and this week, we'll focus on a Core Advancement Proposal that would allow grouping of transactions in order to facilitate the implementation of per-group policies, such as order-book-aware surge pricing.\nIt's a technical discussion, so if you plan on watching, we advise reading through the CAP and the relevant discussion thread for context:\n- CAP-42: Multi-part Transaction Sets\n- Mailing list discussion thread\nCAPs are in a public Github repo, and the discussion threads are on a public mailing list, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation. If you're interested in keeping on top of protocol changes, you can also join the Stellar developers google group: https://groups.google.com/forum/#!forum/stellar-dev"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-3-3-2022",
    "slug": "open-protocol-discussion-3-3-2022",
    "title": "Open Protocol Discussion (3/3/2022)",
    "startDate": "2022-03-03",
    "startTime": "19:00 UTC",
    "location": "Virtual",
    "speakers": "Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. This week, we will once again talk through revisions to CAP-42, a proposal that would give validators control of which fee policy to use for individual transactions included in a ledger. We will return to CAP-44, which would provide validators the ability to configure SPEEDEX, a new design for a fully on-chain decentralized exchange that can scale to an arbitrarily high transaction throughput.",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. This week, we will once again talk through revisions to CAP-42, a proposal that would give validators control of which fee policy to use for individual transactions included in a ledger. We will return to CAP-44, which would provide validators the ability to configure SPEEDEX, a new design for a fully on-chain decentralized exchange that can scale to an arbitrarily high transaction throughput.\nIt's a technical discussion, so if you plan on watching, we advise reading through the CAPs and the relevant discussion threads for context:\nCAP-42: Multi-part Transaction Sets\n- Proposal\n- Discussion\nCAP-44: SPEEDEX — Configuration\n- Proposal\n- Discussion\nCAPs are in a public Github repo, and the discussion threads are on a public mailing list, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation. If you're interested in keeping on top of protocol changes, you can also join the Stellar developers google group: https://groups.google.com/forum/#!forum/stellar-dev\nParticipants:\nDavid Mazières\nLeigh McCulloch\nNicolas Barry\nGeoff Ramseyer\nJed McCaleb\nJonathan Jove\nSiddharth Suresh\nTomer Weller\nJustin Rice"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-4-28-2022",
    "slug": "open-protocol-discussion-4-28-2022",
    "title": "Open Protocol Discussion (4/28/2022)",
    "startDate": "2022-04-28",
    "startTime": "18:00 UTC",
    "location": "Virtual",
    "speakers": "Justin Rice",
    "description": "Join us for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. This week, we're focusing on Project Jump Cannon, which will bring native smart contracts to Stellar. It's a technical discussion, so if you plan on watching, we advise reading our recent technical blog post about Project Jump Cannon, as well as the first Jump-Cannon-related CAP and the relevant discussion thread: Project Jump Cannon: Choosing WASMCAP-46: WebAssembly Smart Contract Runtime Environment CAP-46 discussion thread",
    "topics": "Join us for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. This week, we're focusing on Project Jump Cannon, which will bring native smart contracts to Stellar.\nIt's a technical discussion, so if you plan on watching, we advise reading our recent technical blog post about Project Jump Cannon, as well as the first Jump-Cannon-related CAP and the relevant discussion thread:\n- Project Jump Cannon: Choosing WASM\n- CAP-46: WebAssembly Smart Contract Runtime Environment\n- CAP-46 discussion thread\nCAPs are in a public Github repo, and the discussion threads are on a public mailing list, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation. If you're interested in keeping on top of protocol changes, you can also join the Stellar developers google group: https://groups.google.com/forum/#!forum/stellar-dev\nParticipants:\nDavid Mazières\nLeigh McCulloch\nGraydon Hoare\nNicolas Barry\nGeoff Ramseyer\nJed McCaleb\nJonathan Jove\nSiddharth Suresh\nTomer Weller\nJustin Rice\n‍"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-5-5-2022",
    "slug": "open-protocol-discussion-5-5-2022",
    "title": "Open Protocol Discussion (5/5/2022)",
    "startDate": "2022-05-05",
    "startTime": "18:00 UTC",
    "location": "Virtual",
    "speakers": "Justin Rice",
    "description": "Join us on the Stellar Dev Discord for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. Currently, we're focused on Project Jump Cannon, which will bring native smart contracts to Stellar. It's a technical discussion, so if you plan on watching, we advise reading our recent technical blog post about Project Jump Cannon, as well as the Jump-Cannon-related CAPs and the relevant discussion thread: Project Jump Cannon: Choosing WASM\nCAP-46: WebAssembly Smart Contract Runtime Environment CAP-47: Smart Contract Life Cycle\nCAP-48: Smart Contract Asset Interoperability CAPs are in a public Github repo, and the discussion threads are on a public mailing list, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation. If you're interested in keeping on top of protocol changes, you can also join the Stellar developers google group: https://groups.google.com/forum/#!forum/stellar-dev ",
    "topics": "Join us on the Stellar Dev Discord for a live stream of the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. Currently, we're focused on Project Jump Cannon, which will bring native smart contracts to Stellar.\nIt's a technical discussion, so if you plan on watching, we advise reading our recent technical blog post about Project Jump Cannon, as well as the Jump-Cannon-related CAPs and the relevant discussion thread:\n- Project Jump Cannon: Choosing WASM\n- CAP-46: WebAssembly Smart Contract Runtime Environment\n- CAP-47: Smart Contract Life Cycle\n- CAP-48: Smart Contract Asset Interoperability\nCAPs are in a public Github repo, and the discussion threads are on a public mailing list, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation. If you're interested in keeping on top of protocol changes, you can also join the Stellar developers google group: https://groups.google.com/forum/#!forum/stellar-dev"
  },
  {
    "url": "https://stellar.org/community/events/open-protocol-discussion-05-26-22",
    "slug": "open-protocol-discussion-05-26-22",
    "title": "Open Protocol Discussion (05/26/22)",
    "startDate": "2022-05-26",
    "startTime": "18:00 UTC",
    "location": "Virtual",
    "speakers": "",
    "description": "Meeting to discuss changes to the Stellar protocol, current focused on Project Jump Cannon",
    "topics": "Join us on the Stellar Dev Discord for the Stellar Open Protocol Discussion! In these meetings, we discuss and plan for changes to upcoming versions of the Stellar Protocol. Currently, we're focused on Project Jump Cannon, which will bring native smart contracts to Stellar.\nIt's a technical discussion, so if you plan on watching, we advise reading our recent technical blog post about Project Jump Cannon, as well as the Jump-Cannon-related CAPs and the relevant discussion threads:\n- Project Jump Cannon: Choosing WASM\n- CAP-46: WebAssembly Smart Contract Runtime Environment\n- CAP-47: Smart Contract Life Cycle\n- CAP-48: Smart Contract Asset Interoperability\n- CAP-49: Smart Contract Asset Interoperability with Wrapper\n- CAP-50: Smart Contract Interactions\nCAPs are in a public Github repo, and the discussion threads are on a public mailing list and in the Stellar Dev Discord, so if you have questions, comments, or suggestions, you can participate in the advancement of the Stellar protocol by joining the conversation.\n‍"
  }
]